[
  {
    "id": "1",
    "weeks": "1",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) welcome  test "
      },
      {
        "id": "2",
        "value": "(b) Structure:  Words commonly misspelt and the use of the dictionary – advantageous; – possession; – pronunciation; – feasible; – omission; – furniture; – intercede; – treacherous; – weird; – naïve; – dyeing; – writing; – buoyant etc."
      },
      {
        "id": "3",
        "value": "(c) words for week "
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": "By the end of the lesson, students should be able to: (i) list words that are commonly misspelt; (ii) give reason why those words are commonly misspelt;(iii) Draw a table to show commonly misspelt words and their correct spelling. "
      },
      {
        "id": "3",
        "value": "Learner are to be guided to learn the following words;  Anonymous, Grandilo-quence, Empirical, nuance, Oscilating , oblivious, Impervious, nomadic, Convention, arid "
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students; in pairs, list words that are commonly misspelt."
      },
      {
        "id": "2",
        "value": "(i) Students, in pairs, list words that are commonly misspelt. (ii) Student, as a class, gives reasons why those words are commonly misspelt. (iii) Each student draws a table showing commonly misspelt words "
      },
      {
        "id": "3",
        "value": "Student as individuals or as group, look up the meaning of the given words in a dictionary, and use each word in, at least a sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) communication and collaboration"
      },
      {
        "id": "2",
        "value": "(i) Communication and collaboration (ii) Digital literacy (iii) Leadership and their personal development "
      },
      {
        "id": "3",
        "value": "(i) Communication and collaboration (ii) Digital literacy"
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES  (i) chart/flashcards showing some commonly misspelt words  WEB RESOURCES  (i) https://en.m.wikipedia.org/wiki/CommonlymisspelledEnglishwords https://en.m.wikipedia.org/wiki/CommonlymisspelledEnglishwords https://infoplease.com/culture-entainment/journalismliterature/frenuecymisspelled-words https://infoplease.com/culture-entainment/journalismliterature/frenuecymisspelled-words https://infoplease.com/culture-entainment/journalismliterature/frenuecymisspelled-words https://infoplease.com/culture-entainment/journalismliterature/frenuecymisspelled-words"
      },
      {
        "id": "3",
        "value": "(i) hard copy dictionary (ii) online dictionary"
      }
    ]
  },
  {
    "id": "2",
    "weeks": "2",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) Structure , Adverb Types: Adverbs of place Adverbs of manner Adverbs of concession Adverbs of reason Adverbs of purpose  "
      },
      {
        "id": "2",
        "value": "(a) Oral: consonant sounds composition Narrative: ‘The day I will never forget’"
      },
      {
        "id": "3",
        "value": "(c) Sumnary: Practical approach to writing a good ummary- The dos and donts of summary writing"
      },
      {
        "id": "4",
        "value": "d)Vocabulary development Words associated with Advertising "
      },
      {
        "id": "5",
        "value": "(e ) Words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able to: (i) describe an adverb; (ii) list type of adverbs; (iii) use adverb in sentences   "
      },
      {
        "id": "2",
        "value": "By the end of the lesson students should be able to:  (i) explain what a narrative is (ii) analyse the division/constituents of a narrative (iii) write on a topic ‘The day I will never forget’"
      },
      {
        "id": "3",
        "value": "By the end of the lesson, students should be able to: (i) discuss howw summarize; (ii) highlight the dos and donts of summary writing; (iii) summarise any given passage."
      },
      {
        "id": "4",
        "value": "By the end of the lesson, students should be able to: (i) explain what advertising is, (ii) list words that are associated with advertising; (iii) justify the importance of advertising"
      },
      {
        "id": "5",
        "value": "Learners are to be guided to learn the following words: relegate, sublime, tangential, veracity, abridge, venerate, accessible, adumbrate, bourgeois, chaos"
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, in small groups, brainstorm on the meanings of adverbs. (ii) Students, in pairs list types of adverbs. (iii) Each student in the class uses different adverb in different clauses and sentences. (iv) For further studies, students should visit the site below: https://grammar.yourdictionary.com/grammar/adverbs/types-of-adverbs.html https://grammar.yourdictionary.com/grammar/adverbs/types-of-adverbs.html "
      },
      {
        "id": "2",
        "value": "(i)Students, as a class, brainstorm on what a narrative is. (ii) Students, in small groups, analyse the division/constituents of a narrative (iii) Each student, write on a topic ‘The day I will never forget’. (a least 350 words) "
      },
      {
        "id": "3",
        "value": "(i) Students, as a class, describe what summary is and highlight its importance to them. (ii) Students work With their peers to study a text and. its summary, and subsequently highlight the dos and donts of summary writing. (iii) Students, in small group, determine the main ideas in a text, write a draft, edit it and present the final ‘draft to the class fora review. "
      },
      {
        "id": "4",
        "value": "(i) A field trip to an Advertising company. (ii) Students as a class brainstorm on the purpose of advertising (students in pairs sort out from a given jigsaw, puzzle words that are associated with , advertising (iv) Each student justifies the importance of advertising"
      },
      {
        "id": "5",
        "value": "Students as individuals or as a group, look up the meanings of the given words in a dictionary, and use each word in at least, sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and collaboration (ii) Digital literacy (iii) Leadership and their personal development (iv) Digital literacy  "
      },
      {
        "id": "2",
        "value": "(i) Communication and  Collaboration (ii) Leadership and Personal Development "
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Creativity and Imagination (iv) Critical Thinking and Problem Solving "
      },
      {
        "id": "4",
        "value": "(i) Communication and collaboration (iii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving"
      },
      {
        "id": "5",
        "value": "(i) Communication and Collaboration (ii)Digital Literacy "
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "AUDIO  VISUAL RESOURCES   (I) Chart/Fashcards showing some commonly misspelt  https://grammar.yourdictionary.com/grammar/adverbs/types-of-adverbs.html https://grammar.yourdictionary.com/grammar/adverbs/types-of-adverbs.html    (ii) https://www.studyandexam.com/adverb2.html https://www.studyandexam.com/adverb2.html  (iii) https://www.myenglishteacher.eu/blog/types-of-adverb https://www.myenglishteacher.eu/blog/types-of-adverb"
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES (i) Chart/Flashcard (ii)Digital device/MP3 WEB RESOURCES https://literacydevices.net/narrative-essay/ https://literacydevices.net/narrative-essay/  (ii)  https://www.freelancewriting.com/creative-writing/5-tips-writing-a-good-narrative-essay/https://www.freelancewriting.com/creative-writing/5-tips-writing-a-good-narrative-essay/ https://www.freelancewriting.com/creative-writing/5-tips-writing-a-good-narrative-essay/"
      },
      {
        "id": "3",
        "value": "AUDIO VISUAL RESOURCES  Charts/Flashcards WEB RESOURCES  (i) http://beegideas.com/the-dos-and-donts-of-summary-writing/ http://beegideas.com/the-dos-and-donts-of-summary-writing/  (ii) http://www.google.com/amps/s/newblogs2019/04/18/dos-and-donts-of-summarizing/amp http://www.google.com/amps/s/newblogs2019/04/18/dos-and-donts-of-summarizing/amp http://www.google.com/amps/s/newblogs2019/04/18/dos-and-donts-of-summarizing/amp  "
      },
      {
        "id": "4",
        "value": "AUDIO VISUAL RESOURCES (i) Chart/Flashcards showing some commonly used words in Advertising industry WEB RESOURCES https://www.englishclub.com/vocabulary/20advertising https://www.englishclub.com/vocabulary/20advertising  (ii) https://thesaurus.yourdictionary.com/advertisings https://thesaurus.yourdictionary.com/advertisings  "
      },
      {
        "id": "5",
        "value": "(i) Hard copy dictionary (ii) Online dictionary"
      }
    ]
  },
  {
    "id": "3",
    "weeks": "3",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a)  Comprehension:  (listening) identifying a speaker’s style "
      },
      {
        "id": "2",
        "value": "(b)Writing Expository: The merits and demerits of peer groups "
      },
      {
        "id": "3",
        "value": "(c) Summary identification of the writer’s purpose  -to inform -to educate "
      },
      {
        "id": "4",
        "value": "(d) Vocabulary development Words associated with Stock Exchange "
      },
      {
        "id": "5",
        "value": "(e) Words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By  the end of the lesson, students should be able to:  (i) Listen attentively to a speaker/recorded speech in order to deduce the subject matter; (ii) distinguish between listening and hearing; (iii) recognise a speaker’s style."
      },
      {
        "id": "2",
        "value": "By the end of the lesson, students should be able to: (i) explain what an expository essay is; (ii) Analyse the merits and demerits of peer groups."
      },
      {
        "id": "3",
        "value": "By the end of the lesson students should be able to (i) explain the subject matter of a given passage (ii) recognise the writers . purpose in any given passage (iii) highlight the topic sertences in any passage and join them to form its summary"
      },
      {
        "id": "4",
        "value": "By the end of the lesson students should be able to (i) explain what Stock Exchange is (ii) list words that are associated with Stock Exchange (iii) justify the importance of Stock Exchange in relation to national economy."
      },
      {
        "id": "5",
        "value": "Learners are to be guided to learn the following words: Fallacious, mendacious, refurbish, strident, morose, recapitulate, stagnate, nadir, scintillating, pernicious "
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students in small groups listen to a recorded message (via Bluetooth device or any other digital device) and state its subject matter. (ii) Students, as a class, brainstorm on the difference between listening and hearing. (iii) Each student in the class points out the speaker’s style."
      },
      {
        "id": "2",
        "value": "(i) Students, as a class, brainstorm on the composition of expository essay. (ii) Students, in small groups analyse the merits of peer groups. (iii) Each student talks about his/her experience in relation to peer groups. (iv) For further studies, students should study the site below:  https://ourevervdaylife.com/advantagesdisadvantages-peer-group-8165426.html https://ourevervdaylife.com/advantagesdisadvantages-peer-group-8165426.html "
      },
      {
        "id": "3",
        "value": "(I) Students in small groups go through a given passage and determine its subject matter (ii) Students as a class unravel the writer’s purpose in a given passage (iii) Each student in the class highlights the topic sentences in a given passage and joins them to form a summary"
      },
      {
        "id": "4",
        "value": "(i) Afield trip to Nigerian Stock Exchange Commission (ii) Students as a class brainstorm on what Stock Exchange is (iii) Students in pairs list words that are associated with Stock Exchange (iv) Each student justifies the importance of Stock in relation  to national economy.(v) For further studies, student Visit the site below:  https://dictionaryggrnbtidqe.orgfiginancphf.stock-rmarket https://dictionaryggrnbtidqe.orgfiginancphf.stock-rmarket "
      },
      {
        "id": "5",
        "value": "Students as individuals or as a group, look up the meanings of the given words in a dictionary, and use each word in at least, sentence. "
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development"
      },
      {
        "id": "2",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal development (iii) Digital Literacy "
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving"
      },
      {
        "id": "4",
        "value": "(i) Communication and collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving (iv) Digital Literacy"
      },
      {
        "id": "5",
        "value": "(i) Communication and Collaboration (ii)Digital Literacy"
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "AUDIO VISUAL RESOURCES  (i) A chart showing factors that enhance effective listening and factors that hinder effective listening   (i)  https://study.com/academy/lesson/the-style-of-a-speech.html https://study.com/academy/lesson/the-style-of-a-speech.html"
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES (I) A chart showing the merits and demerits of peer group  (i) https://grammar.yourdictionary.com/grammar-rules-and-tips/tips-on-writing-an-excellent-expository-essay.html https://grammar.yourdictionary.com/grammar-rules-and-tips/tips-on-writing-an-excellent-expository-essay.html https://grammar.yourdictionary.com/grammar-rules-and-tips/tips-on-writing-an-excellent-expository-essay.html  (ii) https://oureverydaylife.com/advantages-disadvantages-peer-group-8165426.html https://oureverydaylife.com/advantages-disadvantages-peer-group-8165426.html"
      },
      {
        "id": "3",
        "value": "AUDIO VISUAL RESOURCES Charts WEB RESOURCES  (i) https://www.ereadingworksheets.com/free-reading-wothsheetslauthors-purpose https://www.ereadingworksheets.com/free-reading-wothsheetslauthors-purpose (ii) https://bookpagez.com/blogreading-cornprehension-toolkit-identifing-authors-purpose https://bookpagez.com/blogreading-cornprehension-toolkit-identifing-authors-purpose https://bookpagez.com/blogreading-cornprehension-toolkit-identifing-authors-purpose "
      },
      {
        "id": "4",
        "value": "AUDIO VISUAL RESOURCES (i) Charts/Flashcards showing words that are commonly associated with Stock Exchange WEB RESOURCES  (i) https://dictionaryggrnbtidqe.orgfiginancphf.stock-rmarket https://dictionaryggrnbtidqe.orgfiginancphf.stock-rmarket  (ii)  https://tradebrains.in/tag/words-associated-with-stock-exchangend-their-meanings/ https://tradebrains.in/tag/words-associated-with-stock-exchangend-their-meanings/ https://tradebrains.in/tag/words-associated-with-stock-exchangend-their-meanings/"
      },
      {
        "id": "5",
        "vallue": "(i) Hard copy dictionary (ii) Online dictionary"
      }
    ]
  },
  {
    "id": "4",
    "weeks": "4",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) Comprehension: Reading Differentiating between main and supporting ideas in a prose passage  "
      },
      {
        "id": "2",
        "value": "(b) Summary: Giving a befitting title to a selected passage"
      },
      {
        "id": "3",
        "value": "(c) Vocabulary development: Words associated with Government and Politics"
      },
      {
        "id": "4",
        "value": "(d) words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able to: (i) identify the topic sentence sentence in any paragraph (ii) establish the relationship between a topic sentence and its supporting ideas in any paragraph (iii) identify the Differences between a topic sentence and its supporting ideas in any paragraph."
      },
      {
        "id": "2",
        "value": "By the end of the lesson, students should be able to: (i) read and understand the writer’s purpose in any given prose passage: (ii) identify the salient points in any given prose passage; (iii) appropriate the saen1 points to get a befitting title to any given prose passage. "
      },
      {
        "id": "3",
        "value": "By the end of the lesson; students should be able to: (i) explain the relationship between Government and politics (ii) list words that are associate with Government and Politics; (iii) Analyse the functions, roles of Government and Politics in relation to growth and development of the society."
      },
      {
        "id": "4",
        "value": "Learners are to be guided to learn the Following words: appalling, antecedent, exasperate, maxi pert, reciprocate, subjugate, augment, superfluous, terrestrial "
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, as a class, brainstorm on how to identify the topic sentence sentence in any paragraph (ii) Students, in small groups, work together to establish the relationship between a topic sentence and its supporting ideas in a given prose passage. (iii) Each student identify the Differences between a topic sentence and its supporting ideas in each."
      },
      {
        "id": "2",
        "value": "(i) Students, in small groups, go through a given prose passage and identify the writer’s purpose. (ii) Students, in pairs, bring out the salient points p a given prose passage. (iii) Each student makes use of the salient points to summarise the passage, gives a befitting title to the passage, and subsequently summit to the whole class for subsequently summit to the whole class for review."
      },
      {
        "id": "3",
        "value": "(i) A field trip to the Government Secretariat. (ii) Students, as a class, brainstorm on the . relationship between Government and Politics. . (iii) Each student lists words. that are associated with Government and Politics.(iv) Students, in small groups, analyse the funétions/roles of Government and Politics in relation to national growth and development, (v) For further studies, students should visit the site below: https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and- https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and-https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and-"
      },
      {
        "id": "4",
        "value": "Students, as individuals or as a group, look up the meanings of the given words in a dictionary, and use each word in, at least, a sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": " (i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving"
      },
      {
        "id": "2",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving"
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving (iv) Digital Literacy"
      },
      {
        "id": "4",
        "value": "(i) Communication and Collaboration (ii) Digital Literacy "
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "WEB RESOURCES (i) https://www.cuesta.edu/student/resources/ssc/guidesgudes/readingcomp/307readmainideas.html https://www.cuesta.edu/student/resources/ssc/guidesgudes/readingcomp/307readmainideas.html https://www.cuesta.edu/student/resources/ssc/guidesgudes/readingcomp/307readmainideas.html  (ii)  https://www.slidesshare.net/mobile/Eacademy4u/main-ideas-and-supporting-details https://www.slidesshare.net/mobile/Eacademy4u/main-ideas-and-supporting-details"
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES Charts WEB RESOURCES"
      },
      {
        "id": "3",
        "value": "AUDIO VISUAL RESOURCES (I) Charts F asncards showing common woros used . Government and Politics WEB RESOURCES  (i)  https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and-governmernt https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and-governmernt https://www.macmillandictionary.com/amc)thesaurus-catgorybritish/general-words-relating.to-politics-and-governmernt (ii) https://www.academia.edu/2499C320WORDS-ASSOCIAE:WITH-GOVERNMEcANDPOLITICS-AND-THEIR-MEANING https://www.academia.edu/2499C320WORDS-ASSOCIAE:WITH-GOVERNMEcANDPOLITICS-AND-THEIR-MEANING https://www.academia.edu/2499C320WORDS-ASSOCIAE:WITH-GOVERNMEcANDPOLITICS-AND-THEIR-MEANING "
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "id": "5",
    "weeks": "5",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a)  Comprehension:   Reading: skimming and scanning a selected passage "
      },
      {
        "id": "2",
        "value": "(b) Oral: speaking to persuade or convince (debate) “must be made the school time keeper’ “women are better leaders” “corruption destroys a nation” "
      },
      {
        "id": "3",
        "value": "(c)  structure:  Adjunct, Conjuncts and Disjuncts "
      },
      {
        "id": "4",
        "value": "(d)  Words for the week "
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able to: (i) study a text and detect its subject matter without wasting time (ii) analyse the importance of skimming and scanning to summary writing"
      },
      {
        "id": "2",
        "value": "By the end of the lesson students should be able to. (i) differentiate between adequate and arguments (ii) analyse the components of a debate (iii) make a presentation on one of the given topics recommended for the lesson"
      },
      {
        "id": "3",
        "value": "By the end of the lesson students should be able to.  (i) explain the terms adjuncts conjuncts and disjuncts (ii) recognize adjuncts . conjuncts and disjuncts  in clauses and sentences ,, (iv) use adjuncts iL conjuncts and diejuncte in sentences"
      },
      {
        "id": "4",
        "value": "Learners are to be guided to learn the following words: utopia, refract, adumbrate, construe, repose, allay, adequate, duplicity, dissipate"
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, in small groups, skim and scan a given prose passage in order to detect its subject matter within a limited time (ii) Students in pairs summarize a given passage within a limited "
      },
      {
        "id": "2",
        "value": "(i) Students, as a class, brainstorm on the difference between a debate and argument. (ii) Each student analyses the components of a debate (iii) Students n small groups work in a more structured manner to take a position on an assigned topic and generate reasons or points to support their position "
      },
      {
        "id": "3",
        "value": "(i) Students as a class brainstorm on the meanings of adjuncts conjuncts and disjuncts (ii) Students in small groups identify adjuncts conjuncts and disjuncts in a given passage (iii) Each student uses adjuncts conjuncts and disjuncts in clauses and sefltencos and subsequently submits to the class for a review "
      },
      {
        "id": "4",
        "value": "Students, as individuals or as a group, look up the meanings of the given words in a dictionary, and use each word in, at least, a sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development"
      },
      {
        "id": "2",
        "value": "(i) communication Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem solving (iv) Creativity and imagination .."
      },
      {
        "id": "3",
        "value": "(I) Communication and collaboration (ii) Leadership and Personal Development  "
      },
      {
        "id": "4",
        "value": "(i) Communication and Collàboration (ii) Digital Literacy "
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "WEB RESOURCES  (i) https://pioneer.netsern/html/skim.htm https://pioneer.netsern/html/skim.html  (ii) https://www.prepadyiser.corn/lets-skimming-scanning-skills-video https://www.prepadyiser.corn/lets-skimming-scanning-skills-video "
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES Charts WEB RESOURCES  (i) https://www.lexico.com/definition/debate https://www.lexico.com/definition/debate (ii) https://virtualspeegla.com/blog/guidetodebating https://virtualspeegla.com/blog/guidetodebating "
      },
      {
        "id": "3",
        "value": "AUDIO VISUAL RESOURCES (i) Chart/ Flashcards showing adjuncts conjuncts and disjuncts WEB RESOURCES  (i)  https://www.eItconcourse.com/training./inserviceñexicogrammar/adverbials.html https://www.eItconcourse.com/training./inserviceñexicogrammar/adverbials.html (ii) https ://"
      },
      {
        "id": "4",
        "value": "(i) Hard copy: dictionary (ii) Online dictionary "
      }
    ]
  },
  {
    "id": "6",
    "weeks": "6",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) Oral: Oral composi’tion/ Expository ‘How to pook and serve my favourite meal’ ‘How to change a car tyre’ ‘How to get to my house’ "
      },
      {
        "id": "2",
        "value": "(b) Struture: Plural forms o nouns includin compoñd nouns &g Attorne general Man of war Passer by Grownip Commander-in-chief Governor-General      "
      },
      {
        "id": "3",
        "value": "(c) Writing Writing a story that ends in …. “If I had known I would not have gone out with him” ‘If I had lcnown I would have listened to my mother’ "
      },
      {
        "id": "4",
        "value": "(d) Words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able to: (i) break down a sample essay into it’s constituent parts( introduction, subject matte and conclusion); (ii) analyse the pattern of essay; (iii) develop a well writen essay on one of the given topic."
      },
      {
        "id": "2",
        "value": "By the end of the lesson, students should be able to: (i) describe nouns and nouns compound nouns (ii) analyse the rules that guide the changing of changing of compound nouns to their plural. (iii) generates copius examples of compound nouns and nouns and their plural forms."
      },
      {
        "id": "3",
        "value": "By the end of the lesson students should be able to (i) outline the division if a narrative essay (ii) discuss the types of tenses used in a narrative essay (iii) write a story that ends “If I had known I would not have gone out with him” ‘If I had known I would have listened to my mother’"
      },
      {
        "id": "4",
        "value": "Learners are to oe guided to learn the following.words: foster, nonchalant, mutable, tirade, venerable,’ gregarious, neophyte, chastise, cerebral, desecrate"
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, in pairs, study sample essay presented to them and identify its introduction, subject matter and conclusion. (ii) Students, in small groups, study the sentences in the sample essay along their (iii) following the pattern of the sample essay, each student writes an expository essay on one of the given topics."
      },
      {
        "id": "2",
        "value": "(i) Students, as aclss  brainstorm on the features of nouns and compound nouns. (ii) Students in pairs analyse the rules that guide the changing of changing of compound nouns to their plural. (iii) Each student generates at examples of least ten compound nouns and nouns and their plural forms and submit to the class for a review (iv) For further studies student should visit the site below:"
      },
      {
        "id": "3",
        "value": "(i) Students as a class outline the division or pattern of a narrative essay  (ii) Students in pairs discuss the types of tenses use in a narrative essay (iii) a student writes a story that ends “If I had known I would not have gone out with him” ‘If I had known I would have listened to my mother’ "
      },
      {
        "id": "4",
        "value": "Students as individuals or aa a group, look up the meanings of the given words in a dictionary, and use each word in, at least, a sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving"
      },
      {
        "id": "2",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Critical Thinking and Problem Solving (iv) Digital Literacy "
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development (iii) Creativity and Imagination "
      },
      {
        "id": "4",
        "value": "(i) Communication and Collaboration (ii) Digital Literacy"
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "AUDIO VISUAL RESOURCES  Charts depicting the constituent parts of an expository essay WEB RESOURCES (i) https://grammar.yourdictionary.com https://grammar.yourdictionary.com   (ii) https://scribendi.com/academy/articlesexpositorywritingonhtml https://scribendi.com/academy/articlesexpositorywritingonhtml "
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES (i) A chart showing plural forms of some compound nouns WEB  RESOURCES  (i) https://www.myenglishpages.com/sitefiles/grammar-lesson-plural-comound-nouns.php https://www.myenglishpages.com/sitefiles/grammar-lesson-plural-comound-nouns.php https://www.myenglishpages.com/sitefiles/grammar-lesson-plural-comound-nouns.php  (ii) https://grammar,y.ourdictionary.com/part-of-speech/nouns/compound-noun.html https://grammar,y.ourdictionary.com/part-of-speech/nouns/compound-noun.html "
      },
      {
        "id": "3",
        "value": "WEB RESOURCES  (i) https://www.studymodecom/subjects/essay-on-the-story-which-ends-with-the-words-had-i-known-i-would-have-believed-him-%20pape1.html https://www.studymodecom/subjects/essay-on-the-story-which-ends-with-the-words-had-i-known-i-would-have-believed-him- pape1.html https://www.studymodecom/subjects/essay-on-the-story-which-ends-with-the-words-had-i-known-i-would-have-believed-him- pape1.html (ii) https://earboard.com/blog/a-stcry-which-ends-with-had-known-i-woud-have-believed-him/ https://earboard.com/blog/a-stcry-which-ends-with-had-known-i-woud-have-believed-him/ https://earboard.com/blog/a-stcry-which-ends-with-had-known-i-woud-have-believed-him/"
      },
      {
        "id": "4",
        "value": "(i) Hard copy dictionary (ii) Online dictionary"
      }
    ]
  },
  {
    "id": "7",
    "weeks": "7",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": "",
    "Status": "Mid term Break"
  },
  {
    "id": "8",
    "weeks": "8",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [],
    "learningObjectives": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "id": "9",
    "weeks": "9",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) Structure: Complex sentences (features) Types of cIauses: (i) main clause (ii) subordinate clause"
      },
      {
        "id": "2",
        "value": "(b) Structure: Spelling Dropping ‘e’ e.g Argue-argument Pronounce – pronunciation Love loving Manage-manageable, – Knowledge- knowledgeable Notice noticeable "
      },
      {
        "id": "3",
        "value": "(c ) Vocabulary development Words associated with Sports and Entertainment   development Words associated with Sports and Entertainment  "
      },
      {
        "id": "4",
        "value": "(d ) Words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": "(i) recognise easily words which drop ‘e’ and retain ‘e’  in spelling (ii) analyse the rulesjor Manage manageable, – dropping ‘e’ and retaining ‘e’ in spelling (iii) generate copious examples of words That drop ‘e’ and words that retain ‘e’"
      },
      {
        "id": "3",
        "value": "By the end of the lesson, students should be able to:  (i) analyse the importance of Sports and Entertament in relation youths and national development (ii) list words that are associated with Sports and Entertainment  (iii) use the listed words in appropnate contexts."
      },
      {
        "id": "4",
        "value": "Learners are to be guided to learn the following words: felicitous, hapless, artefact, aquatic, protean, probity, reputable, elude, enthral, inveterate "
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, as a class, brainstorm on the features of a complex sentence. (ii) Students, in small groups,  select complex sentences from a mixed bag of sentences and phrases. (iii) Students pair up to identify main clauses and subordinate clauses in a given list of complex sentences and share class. "
      },
      {
        "id": "2",
        "value": " (i) Students in small groups go through a given passage and recognise words which drop ‘e’ and retain ‘e’ in spelling . (ii) Students as a class collectively analyse rules for dropping ‘e’ and retaining ‘e’ in spellings (iii) Each student generates a long list of words that drop ‘e’ and retain ‘e’ in spellings and share with the class. (iv) For further studies 8tunents Should visit the site below https://www.newtimesco.rw/section/read/228135 https://www.newtimesco.rw/section/read/228135 "
      },
      {
        "id": "3",
        "value": "(i) A field trip to Sports Commission (ii) Students as a class collectively analyse the importance of Sports and Entertainment in relation to  youths and national development (iii) Each student in the class lists words that are associated with Sports and Entertainment  (iv) Each student uses the listed words in appropriate contexts. (v) For further studies, students should visit the site below: https://wwwquia.com/jg1710048list.html https://wwwquia.com/jg1710048list.html"
      },
      {
        "id": "4",
        "value": " Student as individuals or as a group, look up the meanings f the given words in a dictionary, and use each word in, at least, a sentence. "
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and Collaboration (a) Leadership and Personal Development"
      },
      {
        "id": "2",
        "value": "(i) Communication and Collaboration (a) Leadership and Personal Development (iii) Critical Thinking and problem Solving (iv) Digital Literacy"
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (a) Leadership and Personal Development (iii) Critical Thinking and problem Solving (iv) Digital Literacy"
      },
      {
        "id": "4",
        "value": "(i) Communication and Collaboration (I) Digital literacy"
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "AUDIO VISUAL RESOURCES A chart showing and main clause WEB RESOURCES  (i) https://study.com/academy/lesson/what-is-a-complex-sentence-examples-lessong-quiz.html https://study.com/academy/lesson/what-is-a-complex-sentence-examples-lessong-quiz.html https://study.com/academy/lesson/what-is-a-complex-sentence-examples-lessong-quiz.html https://www.thoughtco.corn/main-clause-grammar-term-191584 https://www.thoughtco.corn/main-clause-grammar-term-191584 "
      },
      {
        "id": "2",
        "value": "fammar-tenmL69158’ AUDIO VISUAL RESOURCES Charts/Flashcards showing some words that involve the dropping e arid retaining e in spelling WEB RESOURCES  (i) https://www.newtimesco.rw/section/read/228135 https://www.newtimesco.rw/section/read/228135 https://howtospell.co.uk/droptherule.php https://howtospell.co.uk/droptherule.php"
      },
      {
        "id": "3",
        "value": "  AUDIO VISUAL RESOURCES Charts/Flashcards showing some common words associated with Sports and Entertainment  (i)https://wwwquia. com/jg1710048list.html (ii) https://wwwquia.com/jg1710048list.html https://wwwquia.com/jg1710048list.html (a)  hhps //assnownow Co wordsassociated-withgrtandentertainment-feafures 12"
      },
      {
        "id": "4",
        "value": " (I) Hard copy dictionary (ii) Online dictionary"
      }
    ]
  },
  {
    "id": "10",
    "weeks": "10",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": [
      {
        "id": "1",
        "value": "(a) Oral: Consonant Sounds followed by kw’ n words e.g. Square, squat, squire, squint, Squirrel and so on"
      },
      {
        "id": "2",
        "value": "b) Strtictwe: Punctuation The  use of capital letter, full stop, comma, Semi-colon, question"
      },
      {
        "id": "3",
        "value": "(C)  Writing Article features, ‘language and styles"
      },
      {
        "id": "4",
        "value": "(d) Structure Spelling Homophones- words that sound alike e.g. Quay/key; Chord/cord; Flower /Flour Games/jeans Die/dye "
      },
      {
        "id": "5",
        "value": "(e) Words for the week"
      }
    ],
    "learningObjectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able: to: (i) list words that have kw’ sounds; (ii) pronounce the words correctly (iii) use the words in sentences. "
      },
      {
        "id": "2",
        "value": "By the end of the lesson, student shôuid be able to : (i) Recognise the sign that – represents a punctuation mark and the importance of a capital ie’ at the beginning of a sentence (ii) explain the uses of full stop, comma, semi colon and question mark in groups of  words/sentences: (iii) use capital letters, full stop comma semi . colon and question mark appropriately in writing "
      },
      {
        "id": "3",
        "value": "By the end of the lesson students should be able to: (i) explain what an article (iii) write an article on any given topic. "
      },
      {
        "id": "4",
        "value": "By the end of the lesson students should be able to (i) explain what homophones are. (ii) Distinguish between two homophonic words. (iii) Use two homophonic words in a sentence."
      },
      {
        "id": "5",
        "value": "Learners are to be guided to learn the following words: insatiable, nascent, obsequious, proscribe, affront, aloof, blemish, cavort, caucus, expunge"
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": "(i) Students, in small groups, generate words that have ‘kw’ sounds. (ii) Students, as a class, practice the pronunciation of the words that have ‘kw sounds. (iii) Each student uses each of the words in a sentence. "
      },
      {
        "id": "2",
        "value": "a. read sentences on the board; b.  identify errors in each sentence  (no capital letters) (ii) correct the errors in the sentences (iii) For further studies, students should visit the site below: https://grammar.yourdictionary.com/punctuation/what/fourteen-punctuation-mark.html"
      },
      {
        "id": "3",
        "value": "(i) Students, as a class collectively brainstorm on what an article is. (ii). Students, in small groups,, discuss features language and style of a sample article (newspaper cut out) (iii) Students in pairs write an article on a given topic. "
      },
      {
        "id": "4",
        "value": "(i) Students in small groups brainstorm on the meaning of homophones and give ample. (ii) Students in pairs distinguish between pair of homophonic words. (iii) Individual students use is of homophonic words sentence."
      },
      {
        "id": "5",
        "value": "Students, as individuals or as a group, look up the meanings of the given words in a dictionary, and use each word in, at least, a sentence."
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development  "
      },
      {
        "id": "2",
        "value": "(i)Communication and Collaboration (ii) Leadership and Personal Development (iii) Digital Literacy"
      },
      {
        "id": "3",
        "value": "(i) Communication and Collaboration (ii) Leadership and Personal Development"
      },
      {
        "id": "4",
        "value": "(i) Critical Thinking and Problem Solving (ii) communication and Collaboration (iii) Leadership and Personal Development "
      },
      {
        "id": "5",
        "value": "(i) Communication and Collaboration (ii) Digital Literacy "
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": "AUDIO VISUAL RESOURCES A chart showing words that have kw’ sound WEB RESOURCES (i)  https://rachesebglish.com/kw-consonant-cluster/ https://rachesebglish.com/kw-consonant-cluster/ (ii) https://real.englishschool.eu/bg/es-blog/consonant-cluster-29-qu-k https://real.englishschool.eu/bg/es-blog/consonant-cluster-29-qu-kw "
      },
      {
        "id": "2",
        "value": "AUDIO VISUAL RESOURCES A chart showing different punctuation marks WEB RESOURCES (i)  https://grammar.yourdictionary.com/punctuation/what/fourteen-punctuation-mark.html https://grammar.yourdictionary.com/punctuation/what/fourteen-punctuation-mark.html https://grammar.yourdictionary.com/punctuation/what/fourteen-punctuation-mark.html "
      },
      {
        "id": "3",
        "value": "(i) Newspaper articles (ii) Charts WEB RESOURCES https://grammar.yourdictionary com/grammar-rules-and- tips-on-writing-good-feature-for magazines.html "
      },
      {
        "id": "4",
        "value": "AUDIO VISUAL RESOURCES A chart showing homophones WEB RESOURCES  (i) https //examples yourdictionary.com/example-of homophones.ht ml (ii)https://rachelsenglish.com/homophones-english. "
      },
      {
        "id": "5",
        "value": "(i) Hard cop dictionary (ii) Online dictionary"
      }
    ]
  },
  {
    "id": "11",
    "weeks": "11",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": "",
    "learningObjectives": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "learningActivities": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "embeddedCoreSkills": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "learningResources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "id": "12",
    "weeks": "12",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": "",
    "Status": "REVISION"
  },
  {
    "id": "13",
    "weeks": "13",
    "subject": "English",
    "class": "SS1",
    "term": "Third term",
    "topics": "",
    "Status": "EXAMINATION"
  }
]
