[
  {
    "_id": "1",
    "Weeks": "1",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Idanwo ranpe fun ibeere saa tuntun Eya ara-ifo"
      },
      {
        "id": "2",
        "value": "Asa Eko ile Ikini (Akoko,ise, igba)"
      },
      {
        "id": "3",
        "value": "Litereso:Atunyewo Orisiirisii eya litrese"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Idanwo ranpe fun ibeere Saa tuntun i. Salaye awon eya ara ti a fi n pe iro ede, awon afipe akanmole ii. Sapejuwe ipo tie nu ahon ati ete wa wa ninu pipe faweli ede Yoruba."
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye ikini ti o wa ii. akoko ati igba(B.a, igba ojo, igba oye, igba otutu ati bee bee lo)"
      },
      {
        "id": "3",
        "value": "Awon akeekoo pinrasi isori meta Isori kini daruko awon iwe apileko ti won ti ka Isori keji soro nipa awon iwe litereso oloro-geere ti won ti ba pada. Isori keta bakan naa se atotonu nipa iwe ere-onise apileko ti won ka"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon ajekoo dahun awon ibere Awon akekoo pinra si isori meji Isori akoko daruko eya ara-ifo afojuri -Awon akekoo jiroro nipa awon iro edeattumo IPA Isori keji daruko eya ara-ifo aifojuri Isori kiini daruko afipe, asunsi, ikeji daruko afipe akanmole."
      },
      {
        "id": "2",
        "value": "Awon akekoo pinrasi isoori meji, eyi ni oobi ati won ooo A ri omo okunrin ati obirin Isori akekoo kookan se orisiirisii ikini."
      },
      {
        "id": "3",
        "value": "Awon akeekoo pinrasi isori meta Isori kini daruko awon iwe apileko ti won ti ka Isori keji soro nipa awon iwe litereso oloro-geere ti won ti ba pada. Isori keta bakan naa se atotonu nipa iwe ere-onise apileko ti won ka"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isoro Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara"
      },
      {
        "id": "2",
        "value": "Ajemawujo Ogbon Arojinlo ati yiyanju isero Oqon Ajumose ati ibanisoro"
      },
      {
        "id": "3",
        "value": "Oogbon  Ajumose ati ibanisoro Ogbon Atinuda ati Oye Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "2",
    "Weeks": "2",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Itesiwaju lori eko iro ede Yoruba"
      },
      {
        "id": "2",
        "value": "Asa Ise Abinibi ile wa"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idnlekoo, awon akekoo yoo le: i. so oriki iro-ede ii. Salaye orisii iro ede ti o wa (konsonanti, faweli ati ohun) ii. Se adako konsonanti ati faweli ni ilana adako fonetiki International Phonetie Assoeiation (IPA)"
      },
      {
        "id": "2",
        "value": "Ni opin idsanilekoo, awon akekoo yoo le: i. Salaye awon isori ise abinibi ile Yoruba -Drauko ise abinibi labe isori kookan. -Juwe ona ti a n gba ko ise abinibi nile Yoruba"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "-Awon akekoo pinra si abe isori meji. -Won jiroro nipa awon iro-ede Yoruba ati itumo IPA -Awon isori akooko salaye iro faweli airanmupe ati aranmupe -awonj isori keji so nipa iro konsonanti -Oluko ko awon akekoo bia se adako fonetiki ede Yoruba."
      },
      {
        "id": "2",
        "value": "Awon akekoo daruko oniruuru ise abinibi ile Yoruba -Oluko salye isori ise abinibi ile wa.Bi apeere: ise ebu, ajemo idile, ajemo esin, owo sise ati eyi ti ako. -Awon akekoo salaye awon ise labe isori wonyi"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Ajumose ati ibanisoro Oqoon Arojinle ati yoyanju isoro Eko Ero Ayelujara"
      },
      {
        "id": "2",
        "value": "Ogbon Ajumose ati ibanisoro Oqoon Arojinle ati yoyanju isoro Eko Ero Ayelujara"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saatiu ti ose afihan ilana adako fonetiki han Fonran ti o sapejuwe bi a se n pe iro fawelu, konsonanti ati iro ohun."
      },
      {
        "id": "2",
        "value": "https://www.google.com/search?rlz=1C1CHBDenNG909Ng()(&amp;sxsrf=ALeKk01eUuwJICSPgMKGNIuVj%25i0XaeXg%3A1598979193469&amp;ei=eXxOX8iXHMKT1fAP70a64AU&amp;g=i%E1%B9%A3%E1%BA%B9%CC%C1E1%B9%A3%E1%BA%B9%CC%C1E1%B9%A3%E1%BA%B9%CC%C1+wa&amp;gsIcp=CgZwc3ktYYWIQRgAMgQIIxAnUABYAGCU-wFoAXAAeACAAfYDiAH2A5IBAzUtMZgBAKoBB@d#cy13XrAAQE&amp;sclient-ab=psy"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "3",
    "Weeks": "3",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: itesiwaju lori eko iro ede Yoruba Apejuwe iro faweli"
      },
      {
        "id": "2",
        "value": "Asa: Owe"
      },
      {
        "id": "3",
        "value": "Litireso: Igbadun ti o wa ninu litireso alohhun (ere, onise, Esa/iwi Egungun, ijala)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awen akekoo yoo le: i. salaye apejuwe iro faweli (nipa irsi ete giga ahon yiya enu ati imu afase) ii. Ya ate faweli aranmupe ati airanmupe"
      },
      {
        "id": "2",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Pa orisirisi owe ii. Salaye awon ohun ti a n owe fun (B a, imoran, iyanju, iriri abbl)"
      },
      {
        "id": "3",
        "value": "Ni opin idanlekoo, awon akekoo yoo le: i. So awon orisirisi litereso alohun ajemesin ti o won mo. ii. Salaye awon igbadun ti o wa ninu awon litireso alohun womyi (B. A isinje, imura idan pipa)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo se apejuwe iro faweli nipa irisi ete mejeji, giga ahon si enu, ipo imu ati fase ati ibi ti o ga julo lra ahon -Awon akekoo ya ate faweli kookan n ko ninu iro ede. Awon akekoo se akosile koko eko sinu iwe."
      },
      {
        "id": "2",
        "value": "– Awon akekoo se itumo owe – Awon akekoo pa owe orisirisi owe. – Awon akekoo pin owe si isori iwulo owe. Bi apeere:owe ibawi Ikilo, iyanju, iriri, isiti abbl -Awon Akekoo se akosile koko iss sinu iwe won"
      },
      {
        "id": "3",
        "value": "Awon akekoo pinra si isori meji – Awon akekoo ni isori akoko jiroro nipa ohun litireso ajemo-ewi – Awon akekoo ni isori keji so nipa litireso oloro-geere. -Isori mejeeji salaye awon igbadun to wa ninu ewi ati oro-geere. -Awon akekoo se akosile koko eko simu iwe won."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Oogbon atinuda ati ifojusun Ogboon Ajumose ati ibanisoro Ogbon Atinuda ati oye Ogbon Arojinle ati yiyanju isoro"
      },
      {
        "id": "2",
        "value": "Ogbon Ajumose ati ibanisoro Ogboon Atinuda ati Oye Eko Ero Ayelujara Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Ajumose ati Ibanisoro Ogbon Atinuda ati Oye Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "i. Digi ii. Ate faweli airanmupe ati faweli aranmupe"
      },
      {
        "id": "2",
        "value": "Saati ti a koo orisiirisii owe ile Yoruba si. https://asaatioweyorubablogspot.com/ https://www.goglee.com/ https://www.googlee.com/SEARCH?Q=OWE+YORUBA&RLZ=1C!CHBD_enNG909NG909&oq+owe+yoruvba&ags=chrome..69i57j0l75973j0j9&sourceid=chrome&ie=UTF-8"
      },
      {
        "id": "3",
        "value": "Ate ti aya eta litireso Alohun si."
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "4",
    "Weeks": "4",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Itesiwaju lori eko iro ede Apejuwe iro kosonanti"
      },
      {
        "id": "2",
        "value": "Asa Ounje ile Yoruba Sise ounje awujo Yoruba (iyan, Eegbo, Amala)"
      },
      {
        "id": "3",
        "value": "Litireso: ogbon itopinpin (Litireso ede Yoruba Yoruba oloro)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. So awon iro knnsonnti inu ede Yoruba ii. Sapejuwe bi a se n pe awon iro knonsonanti nipa lilo ibi isenupe, ona isenupe, afase ati ipo tan-an-na,"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. So awon ounje ti awon Yoruba maa n se. ii. Salaye kikun lori bi a se n ounje ti a n pe ni iyan ati obe osiki."
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. salaye ohun ti ogbon itopinpin tumo si ii. salaye awon ohun ti a maa n sa mulo fun ogbon itopinpin iwe litireso a ileko (b.a onkowe, itan ni soki, awon eda itan, ona isowolede abbl)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "-Awon akekoo daruko awon iro konsonanti inu ede Yoruba. – Awon akekoo salaye bi a se n pe iro Konsonanti nipa lilo ibi isenupe, ona isenupe,afase ati ipi alafo-tan-an-na. – Awon akekoo ko koko ise sinu iwe"
      },
      {
        "id": "2",
        "value": "– Awon akekoo daruko orisii ounje lawujo Yoruba. – Awon akekoo si isori merin lati soro nipa bi&nbsp; a ti n se orisii ounje merin lawujo Yoruba"
      },
      {
        "id": "3",
        "value": "– Awon akekoo salaye awon ohun amulo ninu ogbon itopinpin litirese ede Yoruba. – Awon akekoo dahun ibeere lori imo afeyinwa nipa litirese -Awon akekoo se akosile koko ise."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Ajumose ati Ibanisoro Ogbon Atinuda ati Oye Eko Ajelujara"
      },
      {
        "id": "2",
        "value": "Ogbon Ajumose ati Ibanisoro Ogbon Atinuda ati Oye Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon atinuda ati Oye Ogbon Arojinle ati yiyanju isoro Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara Ogbon Idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti o se apejuwe bi a se n pe awon iro konsonanti i. Digi ii. Awon eya ara ifo awon akekoo. https://www.google.com/search?q=eya+ara+ifo&lz=1C1CHBD_enNG909NG()(&oq=eya+ara+ifo&ags=chrome.069i59j0l7_4843j0j9&sourceid=chrome&ie=UTF-8"
      },
      {
        "id": "2",
        "value": "Aworan ti o se afihananawon orisiirisii ounje ile Yoruba. Isu, odo ati omo odo, egusi ati awon ohun elo obe. https://www.google.com/search?q=ounje+ile+yoruba&amp;rlz=1C1CHBD_enNG909NG909&amp;oq=ounje+ile+yoruba&amp;ags=chrome..69i57.6380j0)j(&amp;&amp;sourceid=chrome&amp;ie=UTF-8"
      },
      {
        "id": "3",
        "value": ">Saati ti n se afihan orisi ogben itopinpin."
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "5",
    "Weeks": "5",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Itesiwaju lori eko iro ede Yoruba (ilo ohun)"
      },
      {
        "id": "2",
        "value": "Asa: Awon owe ti o je mo asa Yoruba (Igbeyawo, isomoloruko iran-ara eni lowo Abbl)"
      },
      {
        "id": "3",
        "value": "Literese: Itupale asayan iwe itan Aroso apileko ti ajo WAEE/NEEO yan. Akojopo alo ijapa(Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo. Awon akekoo yoo le: i. Salaye orisii iro ohun geere eleyoo ii. Salaye orisii iro ohun geere (ohun oke, isale ati aarin) iii. Sapejuwe lo ohun eleyoo roke ati eleyoorodo"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, aon akekoo yoo le: i. Salaye oriki owe ii. pa orisiirisii owe iii.. pa awon owe ti o ye mo asa igbeyawo m isomoloruko isinku, iran-araeni lowo abbl"
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. So nipa onkowe yii ii. Salaye itan inu iwe naa ni soki iii. Sapejuwe awon eda itan inu iwe litirese yii"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo ki oriki ami ohun. – Awon akekoo soro lori bi iro ami ohun kookan se n dun – Awon akekoo se akesole koko eko sinu iwe won"
      },
      {
        "id": "2",
        "value": "-Awon akekoo p orisii owe ti o jemo asa kookan -Awon akekoo si isori merin -Isori akoko pa owe ti o jemo asa igbeyawo ninu awon owe ti oluko ko soju patako ikowe. -Isori keji salaye awon owe ti o jemo asa isomooloruko -Isori keta se apeere awon ti o jemo asa iranraenilowo. -Isori kerin soro lori owe ti o jemo esin -Awon akekoo se akosile koko ise"
      },
      {
        "id": "3",
        "value": "– Awon akekoo soro nipa onkowe Litirese Apileko oloro geere Akojoo Alo Ijapa ni seki. -Awon akekoo salye nipa awon eda itan inu iwe litirese yii ati ipa ti won ko ninu"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yoyanju isero Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yoyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ifowosewopo ati Ibaraenisoro Ogbon Atinuda ati Ifojusun. Ogbon Atinuda ati Oye Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati to n se afihan orisi iro ohun to wa ati bi a se le n lo won"
      },
      {
        "id": "2",
        "value": "Kadiboodu/saati ko orisirisii owe ti o jomo awon asa Yoruba si: https://www.google.com/search?q=A%CC%25*!+O+J%e1%BA%B9+m%E1%25A%CC%25*!+O+J%e1%BA%B9+m%8D+a%CC%80%E1%B9%A3%CC%80+Yoru%CC%80ba%CC+%81+(I%CC%80gbe%CC%0ba%CC+%81+(I%CC%80gbe%CC%25%200ba%CC+%81+(I%CC%80gbe%CC%251%BA%B9+m%E1%25A%CC%25*!+O+J%0ba%CC+%81+(I%CC%80gbe%CC%0ba%CC+%81+(I%CC%80gbe%CC%0ba%CC+%81+(I%CC%80gbe%CCggg1%BA%B9+m%E1%25A%CC%25*!+O+J%e1%BA%81&ags=chrome..69i57.1137j0j9&sourceid=chrome&ie=UTF-8"
      },
      {
        "id": "3",
        "value": "Iwe litirese appileko Akojopo Alo “ijapa” Aworan iru eranko ti ijapa je -Wiwo ere alo lori ero telifisan. Bi apeeree: Magie Yoruba"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "6",
    "Weeks": "6",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Silebu ede Yoruba"
      },
      {
        "id": "2",
        "value": "Asa: nWon owe ti o suyo ninu ise ati ise Yoruba"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe litirese oloro geere ti ajo WAEE/NEEO yan. ‘Akojopo alo ijapa (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ninopin idanilekoo awon akeko yoo le i. Salaye oriji silebu ii. Salaye awon batani ihun silebu pelu apeere iii. So awon ote ti o de silrbu erde Yoruba"
      },
      {
        "id": "2",
        "value": "NI opin idanileekoo, awon akekoo yoo le: i. pa oniruru owe ti o jemo ise ile Yoruba ii. Pa oniruuru owe ti o jemo ise Yoruba"
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Se alaye kikun nipa ipa ti awon eda itan ko ninu iwe itan aroso apileko oloro geere yii"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo yoo so oriki silebu – Awoon akekoo se yoo sapejuwe batani ihun silebu pelu apeere. -Awon akekoo yoo salye awon ote to de silebu ede Yoruba – Won akekoo se akesilo koko eko sinu iwe won lati oju patako."
      },
      {
        "id": "2",
        "value": "– Awon akekoo pa awon owe ti on suyo ninu asa ati ise Yoruba. -Oluko se akosile awon awon owe naa. -Awon akekoo so iyumo ti o wa albe owe kookan. – Awon akekoo se akosile koko ise."
      },
      {
        "id": "3",
        "value": "– Awon akekoo si isori meta – Awon akekoo jiroro lori ipa ti eda-itan kookan ko ninu iwe Litirese Akojopo Alo Ijapa ti Ajo WAEE yan. – Awon akekoo se akosile koko ise"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ayelujara"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Ifojusun Ifowosowopoati Ibaraenisoro Ogbon Atinuda ati Oye Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Ogbon idari Akekoo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko awon batani ihun silebu si: Kaadi pelebe pelebe ti a ko awon oro ti a ge si silebu si https://www.google.com/search?=Si%CC%81le%CC%81bu%CC%80+e%CC%80de%CC%80+Yoru%CC%80ba%CC%81&rlz=1C1CHBD_enNG909NG909&oq=Si%CC%81le%81bu%CC%80+e%CC%81&ags=chrome..69i57.1287j0j9&sourceid=chrome&ie=UTF-8"
      },
      {
        "id": "2",
        "value": "Saati ti o se afihan oniruru awon owe ti o fi ise ati ise Yoruba han.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko: Akojopo Alo Ijapa Akojopo Alo Ijapa ti Adeboye Babalola"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "7",
    "Weeks": "7",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "Mid Term Break"
  },
  {
    "_id": "8",
    "Weeks": "8",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Akoto Ede Yoruba"
      },
      {
        "id": "2",
        "value": "Asa: Iwa omoluabi ati anfaani re i. orisiirisii iwa omoluabi ii. Awon amuye iwa omoluabi. Bi apeere: ikini, ibowo agba iberu Olodumare, iran ara-eni lowo abbl"
      },
      {
        "id": "3",
        "value": "Litirese itupale asayan iwe Litirese a ile ko oloro geere ti Ajo WAEE/NEEO yan Ákojopo lo Ijapa (Adeboye Babalola) Asa ati ise Yoruba ti o suyo nibe"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "N opin idanilekoo, awon akekoo yoo le: i. Salaye itan bi ede Yoruba se di kiko sile ii. Salaye awon ayipada ti o de ba kiko ede Yoruba sile (ilana akoto ode oni)"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le; i. Sapejuwe iru omo ti a n pe ni omoluabi ii. Salaye awon orisiirisii iwa omoluabi ninu ile, laarin ebi, ilu ati awujo abbl iii. So awon anfaani ti iwa omoluabi maa fun odomodeni awujo"
      },
      {
        "id": "3",
        "value": "Ni opin idanileekoo, awon akekoo yoo le: i. da ka iwe naaa fun ra won ni iyara ikekoo ii. Salaye awon asa ati ise Yoruba ti o suyo ninu iwe litireso apileko yii"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo so itan seki nipa bi ede Yoruba se di kiko sile ati ipa ti awon oyinbo alawo funfun ko – Awon akekoo salaye ayipada to de ba kiko ede Yoruba sile ni ilana akoto ode-oni. -Awon akekoo se akosile koko ise"
      },
      {
        "id": "2",
        "value": "– Awon akekoo daruko apeere iwa omoluabi lawujo – Awon akekoo salaye orisirisii iwa omoluabi – Awon akekoo jiroro nipa anfaani iwa omoluabi – Awon akekoo se akosile koko ise."
      },
      {
        "id": "3",
        "value": "– Awon akekoo pin si iseri meta, iseri kookan yan asoju keji meji- lati ka iwe Akojopo Alo Ijapa ni kilaasi. – Asoju ni isori kookan ka oju ewe merin ni kilaasi – Asoju kookan salaye awon asa ati ise ti o jeyo ninu iwe naa. – Awon akekoo se akosile koko ise."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara Ogbon idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Aworan awon oyinbo alwo funfun ti won koko ko ede Yoruba sile. i. Saati ti a ko ilana akoko atijo ati ode oni https://www.worldcat.orglinkbu.edu https://en.wikipedia.org"
      },
      {
        "id": "2",
        "value": "Aworan odomode ti o n sise Ile fun awon obi re Tabi Aworan odomode ti o gba eru lori agbalagba https://Asatiwantiwa.blogspot.com https://Asatiwantiwa.blogspot.eom"
      },
      {
        "id": "3",
        "value": "Iwe Litirese apileko Akojopo Alo Ijapa (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "9",
    "Weeks": "9",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aroko Kiko"
      },
      {
        "id": "2",
        "value": "Asa: Ise Abinibi ile Yoruba ise iran tabi Ebi (bi apeere: ise ayan, edo, agbede, agbe, aro dida, eni hihun, ikoko mimo, eyin fifo(epo pupa sise)"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe litirese apileko ti ajo WAEE/NEEO yan Ákojopo Alo ijapa (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le i. So oriki aroko ii. Salaye ilana ati ogbon ati ilana ti a n ta fun aroko kiko(B.a ifaara, ipinro, ilo-ede, ero igunle abbl) iii. So orisiirisii aroko ti o wa"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le i. Salaye iru ise ti a npe ni ise abinibi ni ile Yoruba ii. Se apeere orisiirisii ise iran tabi ebi ti o je ise abinibi ni ile Yoruba"
      },
      {
        "id": "3",
        "value": "NI opin idanileekoo, awon akekoo yoo le: i. Da ka iwe litirese yii ni iyara ikekoo won ii. Salaye bi onkowe sese iwa ifiwaweda awon eda itan inu iwe naa."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo salaye oriki aroko – Awon akekoo sapejuwe ogbon ati ilana ti a n gba lati ko aroko – Awon akekoo daruko orisii aroko ni sise-tele – Awon akekoo se akosile koko ise"
      },
      {
        "id": "2",
        "value": "– Awon akekoo daruko orisii ise abinibi ile Yoruba – Awon akekoo soro nipa awon ise abinibi ni ile Yoruba – Awon akekoo se akosile koko ise."
      },
      {
        "id": "3",
        "value": "– Oluko pin awon akekoo si iseri meta, iseri kookan yan aseju keji meji lati ka iwe Akolopo Alo ijapa ni kilaasi. – Asoju ni iseri kookan ka oju ewe merin merin ni kilaasi. – Aoju kookan salaye ifiwaweda awon eda-itan inu iwe naa. – Awon akekoo se akosile koko ise."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati ifojusun.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Ajumose ati Ibanisoro Ogbon idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko awon ilana ati ogbon ti a ti a fi n ko aroko si pelu orisiiridii aroko ti o wa Aroko Lede Yoruba Lawanson mailto:Olumuyiwa@okadabooks.com"
      },
      {
        "id": "2",
        "value": "Aworan awon orisiirisii ise Abinibi ni ile Yoruba https://alawiyeblog.wordpress.com https://olukoniblogspot.com"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko oloro geere ‘Ákojopo Alo Ijapa"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "10",
    "Weeks": "10",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aroko Oniroyin"
      },
      {
        "id": "2",
        "value": "Asa: Awon ona ti a n gba ko ise abininbi ni Ile Yoruba"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe litirese apileko oloro geere ti Ajo WAEE/NEEO yan”Akojopo Alo” (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon aakekoo yoo le i. Salaye iru aroko ti a n fi pe ni aroko oniroyin/ asotan ii. Se apeere oniruuru ori-oro ti o je mo aroko oniroyin /asotan. iii. Salaye awon ilana ti a gbodo mu lo fun kiko aroko oniroyin /asotan io. Ko aroko oniroyin /asotan funra won."
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye eto ati ilana ekose, gbigba iyonda leyin ise,a(tie to ominira omo ekose) ii. Salaye anfaani ti o wa ninu ise kiko iii. Salaye ayipada ti o de ba ise abinibi kiko ni ode-oni."
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Ka iwe litirese naa ni iyara ikekoo. ii. Salaye awon owe ati ona ede ti o jeyo ninu iwe literese yii."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo se iroyin isele kan ti o soju re/won tabi eyi ti won gbo nipa re. – Awon akekoo se apeere orisii oro to jemo aroko. – Awon akekoo soro lori ila ti a gbodo samulo fun kiko aroko oniroyin/asotan. – Awon akekoo ko aroko lori koko oro yii: Ija Igboro ti o sele loju mi. – Awon akekoo se akosile koko ise."
      },
      {
        "id": "2",
        "value": "– Awon akekoo se alaye eto ati ilana ikoseabininbi laye atijo ati ilana gbigba iyonda lenu ise – Awon akekoo daruko awon anfaani tio wa ninu ise kiko – Awon akekoo mjiroro nipa ayipada to de ba ise kiko lode-oni -Awon akekoo se akosile koko ise."
      },
      {
        "id": "3",
        "value": "Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko oloro geere ‘Akojopo alo Ijapa’(Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Iwe iroyin atigbade gba ni ede Yoruba Aroko Lede Yoruba- Lawanson mailto:Olumuyiwa@okadabooks.com https://345poet.wordpress.com https://m.facebook.com ebenezeralonge97.blogspot.com"
      },
      {
        "id": "2",
        "value": "Awon alagbede tabi alaro ni ebu pelu awon omo ekose ti o n ko ni ise."
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "11",
    "Weeks": "11",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Akanlo Ede"
      },
      {
        "id": "2",
        "value": "Asa: Awon ise Abinibi ile Yoruba (Ise ilu lilu, ase hihun ati igba finfin)"
      },
      {
        "id": "3",
        "value": "Litirese kika iwe litirese apileko oloro geere “Akojopo Alo Ijapa” (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "NI opin idanileekoo, awon akekoo yoo le: i. Salaye oriki akanlo ede ii. Se oniruuru apeere akanlo-ede ati itumo won iii.Salaye awon akanlo ede"
      },
      {
        "id": "2",
        "value": "Ni opin ianilekoo, awon akekoo yoo le i. Salaye eto ati ilanaekose, gbigba iyonda lenu ise ati eto ominira omo ekose ii. Salaye awon anfaani ti o wa ninu kiko ilu lilu, ase hijun ati igba finfin. iii. Salaye ayipada ti o de ba ise abinibi kiko ni ode oni."
      },
      {
        "id": "3",
        "value": "Ni opim idanilekoo, awon akekoo yoo le: i. Salaye kikun nipa iwa ati ise olu eda itan. ii. Salaye ipa awon eda itan yoku ninu iwe litirese apileko oloro geere “Akojopo Alo ijapa” (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo salye apeere akanlo ede. -Awon akekoo jiroro nipa iwulo aknlo-ede -Awon akekoo se akosile koko ise."
      },
      {
        "id": "2",
        "value": "– Awon akekoo salaye eto ati ilana ikose, bi a se n bere ise kiko ti bi a se n gba iyonda kuro lenu ekose. -Awon akekoo salye anfaani ti o wa ninu kiko ise ilu lilu ati ase hihun – Awon akekoosoro lori oniruuru ayipada to de b kiko ise abinibi kiko ni ode oni. – Awon akekoo se akosile koko ise."
      },
      {
        "id": "3",
        "value": "– Awon akekoo salaye kikun nipa iwa ati ise olu-eda itan ninu iwe Litirese Apileko Akojopo Alo Ijapa – Awon akekoo soro lori ipa ti bawon eda itan yooku ko ninu iwe naa. – Awon akekoo se akesile koko ise."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati  Ibanisoro Ogbon Idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko oniruuru akanlo-ede si pelu itumo won https://asaatioweileyoruba.blogspot.com "
      },
      {
        "id": "2",
        "value": "Aworan idi ofin ninbi ti oga ti n ko awon omo ekose re ni ise ase hihun https://m.facebook.com https://alamojayoruba.com"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko oloro geere “Akojopo Alo Ijapa (Adeboye Babalola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "12",
    "Weeks": "12",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Igbaradi fun idanwo saa kiini"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "REVISION"
  },
  {
    "_id": "13",
    "Weeks": "13",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "Idanwo saa kin-in-ni"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "EXAMINATION"
  }
]
