[
  {
    "_id": "1",
    "Weeks": "1",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Idanwo ranpe fun ibeere saa tuntun"
      },
      {
        "id": "2",
        "value": "Ede: Atinyewo awon isori oro"
      },
      {
        "id": "3",
        "value": "Asa: Elegbejegbee tabi iro-siro"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Mu gboogbo awon eko ti won ti Ko ni saa ti o koja wa si iranti won &nbsp;"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. So awon isori oro ti o wa ninu gbolohun ede Yoruba ii. Salaye ise ti awon isori oro yii maa n se nbinu gbolohun."
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. alaye egbe ojo ori lokunrin, ati lobinrin. ii. Salaye ipo ati ipa ti elegbejegbe n ko lawujo ninu eto Esin, iselu ati oro aje, idagbasoke ilu. iii. So awon ofin ati eewo egbe"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon Akekoo dahun awon ibeere inu idanwo ranpe fun ibere saa ti o waye"
      },
      {
        "id": "2",
        "value": "Awon akekoo salaye oriki oro Awon akekoo sapejuwe awon isori oro inu gbolohun ati ise ti won n se pelu apeere orisirisi labe okookan. Awon akekoo se akosile ohun ti koko-ise da le lori sinu iwe won lati oju patako ikowe"
      },
      {
        "id": "3",
        "value": "Awon akekoo salaye lori ohun ti egbe je lawujo. Awon akekoo jiroro lori pataki elegbejegbe lawujo Awon akekoo soro lori ofin ati eewo elegbejegbe kookan"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "3",
        "value": "Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Imo Ateyinwa ati akosile ateyinwa"
      },
      {
        "id": "2",
        "value": "Aworan igi ti a se afuhan awon isori oro inu gbolohun ede Yoruba. https://olukopniblogspot.com/ https://345poetwordpress.com/"
      },
      {
        "id": "3",
        "value": "Aworan to bi ibasepo laarin elegbejegbe han"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "2",
    "Weeks": "2",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Awon isori Gbolohun Ede Yoruba (gbolohun Eleyo oro-ise ati gbolohun alakanpo)"
      },
      {
        "id": "2",
        "value": "Asa: Asa Iran-ara-eni-lowo i. Owe ii. Aaro iii. Ebese io. Arokodoko o. Gbami-o-rami"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale Asayan iwe Litirese Apileko Ere Onutan “Nitori Owo” (Akinwumi Isela)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ti ajo WAEE/NEEO yan"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le; i. Salayeoriki gbolohun ede Yoruba ii. Sapejuwe orisirisi gbolohun ede Yoruba iii. Se oniruuru apeere gbolohun fun awon orisirisi gbolohun ti won ti daruko"
      },
      {
        "id": "2",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Salaye awon orisirisi ona ti awon Yoruba n gba ran ara won lowo ii. Salaye awon anfaani riran-ara-eni-lowo"
      },
      {
        "id": "3",
        "value": "Ni opin idamnilekoo, awon akekoo yoo le: i. Sapejuwe onkowe ii. So itan inu iwe naa ni soki"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon akekoo Awon akekoo salaye oriki gbolohun. Awon akekoo sapere orisirisi gbolohun ti oluko si ba wwon ko o si oju patako ikowe sapejuwe orisirisi gbolohun pelu opolopo apeere Awon akekoo se akosile ohun ti koko da le lori sinu iwe won lati oju patako ikowe &nbsp;"
      },
      {
        "id": "2",
        "value": "Awon akekoo salaye lori orisirisi ona ti Yoruba n gba rab ara won lowo Awon akekoo jiroro lori iyato laarin asa iranraeni lowo wonyi a) Owe ati Aaro (b) Esusu ati Ajo (d) Arokodoko ati Gbami-orami Awon akekoo se akosile awon ohun ti koko ise da le lori sinu iwe wwon lati oju patako ikowe"
      },
      {
        "id": "3",
        "value": "Awon akekoo sapejuwe onkowe litirese ere-onise ‘Nitori Owu’ latowo Akinwumi Isola pelu ohun ti won ti won ti ka tabi gbo nipa onkowe yii. Awon akekoo soro nipa itan iwe naa ni kilaasi"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Eko Ajemawujo Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko orisirisi gbolohun si pelu apeere won https://m.facebook.com/"
      },
      {
        "id": "2",
        "value": "Awon Aworan ti o se afihan asa iran-ara-eni lowo ni ile Yoruba &nbsp; &nbsp; https://olukoniblogspot.com/ https://m.facebook.com/"
      },
      {
        "id": "3",
        "value": "Iwe Litirese apileko ere onitan “Nitori owo”"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "3",
    "Weeks": "3",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede “Awon isori Gbolohun Ede Yoruba gege bi ise won i. Gblohun alaye ii. Gbolohun ibeere iii. Gbolohun ase io. Gbolohun Kani/Iba o. Gbolohub akiyesi alatenumo"
      },
      {
        "id": "2",
        "value": "Asa: Asa iran-ara-eni-lowo i. Esusu ii. Aradosu iii. Egbe io. Owo ele abbl"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe Litirese apileko, ere onitan “Nitori owo” (Akinwunmi Isela) ti ajo WAEE/NEEO yan"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Salaye orisiirisii gbolohun gege bi ise won ii. Se oniruru apeere fun awon isori gbolohun ti won ti ko"
      },
      {
        "id": "2",
        "value": "NI opin idanilekoo, awaon akekoo yoo le: i. Salaye awon oniruuru ona ti awon Yoruba n&nbsp; gba ran ara won lowo ii. Se awon iwulo ati anfaani asa iran-ara-eni-lowo ni awujo wa."
      },
      {
        "id": "3",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Sapejuwe ibudo itan ii. Salaye ipa ti awon eda itan ko ninu iwe yii"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon akekoo daruko orisiirisii gbolohun ti oluko salaye soju patako ikowe Awon akekoo fa oniruuru eya gbolohun jade ninu apeere awon gbolohun ti won daruko Awon akekoo daruko awon wunren atoka gbolohun ibeere lorisirisi. Awon akekoo salaye gbolohun ti a n gba seda gbolohun akiyesi alatenumo &nbsp;"
      },
      {
        "id": "2",
        "value": "Awon akekoo daruko orisirisi ona ti awon Yoruba n gba ranra won lowo laye atijo Ti ode oni Bi won se n daruko awon asa iranra-eni-lowo bee ni oluko n ko won soju patako ikowe. – Salaye awon asa iranra-eni-lowo lode-oni – Se akosile koko eko sinu iwe won lati oju ptako ikowe &nbsp; &nbsp;"
      },
      {
        "id": "3",
        "value": "–&nbsp; Awon akekoo wa ni isori meji, isori kookan yan asoju meta meta lati jiroro. – Awon isori akekoo soro lori ohun ti won ka nipa ibudo-itan ninu iwe ere-onile Nitori Owo – Awon isori akekoo keji salye lori ipa ti awon eda inu itan iwe litirese yii ko. -Awon akekoo se akoosile ohun ti koko ise da le loriko sinu iwe lati oju patako ikowe &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko awon isori gbolohun ede Yoruba ba si pelu Ppdlo.eom"
      },
      {
        "id": "2",
        "value": "Kaadi pelebe ti o se afihan ajo dida ojoojumo Kaadi kekere ti idanimo gege bi omo egbe &nbsp; alajeseku https://edudelighttutors.com/ https://olukoniblogspot.com/"
      },
      {
        "id": "3",
        "value": "Iwe Litirese apileko rer onitan ‘Nitori owo’ (Akinwunmi Isola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "4",
    "Weeks": "4",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aroko Asapejuwe"
      },
      {
        "id": "2",
        "value": "Asa: Ise akanse i. Rire ase laro(Aro dudu) ii. Eni: Eni hihun iii. Ileke: Ileke siinsin io. Amo: Ikoko mimo o. Ilu:ilu sise"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale Asayan iwe litirese apileko ere onitan ti ajo WAEE/NEEO yan “Nitori owo (Akinwunmi&nbsp; Isela)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye iru aroko ti aroko asapejuwe je ii. Salaye awon ilana kiko aroko asapejuwe iii. So apeere ori-oro ti o jemo aroko asapejuwe io. Ko aroko asapejuwe&nbsp; funra won"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Se ise akanse lori okan tabi meji ninu awon ise akanse yii nipa ii. Rire aro laso funra won iii. Hun eni tabi oniko funra won tabi lo owu lati sin ileke, ileke orun &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;"
      },
      {
        "id": "3",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Da ak iwe yii funra ni iyara ikekoo ii. Salaye awon eko ti o suyo ninu ibi ti won ka. iii. Salaye awon asa Yoruba ti o suyo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon akekoo salaye orisirisi aroko ti o wa – Awon akekoo salaye ohun ti aroko asapejuwe je pelu apeere ori oro ti o jemo aroko asapejuwe – Awon akekoo samulo awon ilana kiko aroko latiko aroko asapejuwe – Awon akekoo ko aroko lori ori-oro to jemo aroko asapejuwe."
      },
      {
        "id": "2",
        "value": "Ise akanse i. rire ase laro (Aro dudu) ii. Eni: Eni hihun iii. Ileke: Ileke sinsin io. Amo: Ikoko mimo o. Ilu: Ilu sise"
      },
      {
        "id": "3",
        "value": "– Awon akekoo pin si iseri merin. -Iseri kookan yn aseju meji meji latika iwe litirese apileko ‘Nitori Owo’ -Awon aseju iseri kookan yoo ka oju iwe marun-un marun-un tele ara won ninu kilaasi -Awon akekoo ni isori kookan salaye eko ti o suyo ninu abala ibi ti won ka ninu iwe litrese naa -Awon akekoo ni iseri kookan salaye awon asa Yoruba ti o suyo&nbsp; ninu ibiti won ka ni kilaasi -Awon akekoo se akosile ohun ti koko ise da le lori sinu iwe won lati oju patako &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon wiwa ojutuu si isero ati arojinle Ogbon Atinuda ati afojusun Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ajumose ati Ibanisoro Ogbon Idari Akekoo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Aworan leta-apejuwe ti enikan ti ko gege bi apeere https://ebenezeralonge97blogspot.com/ https://m.facebook.com/ mailto:Olumuyiwa@okadabooks.com"
      },
      {
        "id": "2",
        "value": "Aro dudu, ileke ati owu Amo fun mimo ikoko"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko ere-onitan ‘Nitori owo’ (Akinkunmi Isela) Kaadi pelebe pelebe ti ati ko awon oro tuntun to suyo ninu iwe naa"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "5",
    "Weeks": "5",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Akanlo Ede"
      },
      {
        "id": "2",
        "value": "Asa: Oge sise nile Yoruba"
      },
      {
        "id": "3",
        "value": "Litirese: Ituopale asayan iwe litirse apileko ere-onitan ti ajo WAEE/NEEO yan “Nitori Owo” (Akinwunmi&nbsp; Isola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "NI opin idanilekoo, awon akekoo yoo le i. Salaye oriki akanlo ede ii.Se oniruuru apeere akanlo-ede iii. Lo awon akanlo-ede ninu gbolohun lati fi itumo won han"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye bi a se n se itoju ara lapapo ii. Okunrin ati obinrin iii. Salaye awon ayipada ti o de ba ase wiwo aye atijo ati ode-oni"
      },
      {
        "id": "3",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Da ka iwe litirese yii funra won ninu iyara ikekoo. ii. Fa awon owe ati akanlo-ede ti o jeyo nibi ti won ka jade."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Won akekoo se orisiirisi akanlo-ede – Bi won se n so awon akanlo-ede yii bee ni oluko n ko won si oju patako -Awon akekoo salaye oriki akanlo-ede – Awon akekoo lo akanlo-ede ni oro lati fi itumo re han. -Awon akekoo se akosile koko ti nise da le lori sinu iwe won lati oju patako ikowe &nbsp;"
      },
      {
        "id": "2",
        "value": "Awon akekoo sapejuwe bi ase n se itoju ara nipa oge sise laye atijo ati ode-oni. -Awon akekoo salye ijora ati iyato oge sise laarin obinrin ati okunrin -Awon akekoo salaye awon ayipada to de ba ase wiwo aye atijo ati ode oni – Awon akekoo se adako koko sinu iwe won &nbsp; &nbsp; &nbsp;"
      },
      {
        "id": "3",
        "value": "-Awon akekoo pin si isori merin -Iseri egbe akekoo yan asoju meji meji nninu egbe won ti won ti ko pari ninu iwe kika ni kilaasi – Awon asoju akekoo ka oju iwe marun-un marun-un ni sise-n-kele ni kilaasi – Isori awon akekoo kookan salaye awon owe ti o suyo ninu ibi ti won ka – Se akosile ohun ti koko ise da le lori sinu iwe won. &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero &nbsp; Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Saati ti a ko oniruuru akanlo-ede pelu itumo won si Youtube.KAPTO https://m.facrbook.com/ https://www.scribed.com/"
      },
      {
        "id": "2",
        "value": "Aworan ti o se aihan asa ase wiwo ni ile Yoruba ati fila https://m.facebook.com/ https://steenut.com/"
      },
      {
        "id": "3",
        "value": "Iwe litirese apileko ere onitan. “Nitori owo” (Akinwunmi Isela)"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "6",
    "Weeks": "6",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aayan Ogbufo"
      },
      {
        "id": "2",
        "value": "Asa: Asa igbeyawo Abinibi"
      },
      {
        "id": "3",
        "value": "Litirese:itan ooro geere gege bi orisun itan orisun itan isedale ati asa Yoruba"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "NNI opin idanilekoo, awon akekoo yoo le: i. Salaye ohun ti an pe ni aayan ogbufo. ii. Salaye awon ilana fun sise aayan ogbufo lati ede geesi si ede Yoruba iii. Sa aayan ogbufo, akaye oloro geere tabi ewi ni ede Geesi si ede Yoruba"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye awon ilana tabi igbese inu asa igbeyawo abibibi (b. Ifojusode, iwadii, itoro, alrina, isihun ati ijohen abbl). ii. Salaye awon ohun elo idana (ohun elo igbeyawo) iii. Salaye eko ti o wa ninu ki oko gba ibale iyawo re"
      },
      {
        "id": "3",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Salaye itan isedale Yoruba ii. Sapejuwe awon eya Yoruba"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "-Awon akekoo salaye itumo aayan ogbufo -Awon akekoo so ni awon ede ti aayan ogbufo ti n waye – Awon akekoo salaye ilana ati igbese ti a nilati samulo ninu aayan ogbufo -Awon akekoo se aayan ogbufo oloro geere lati inu ede Geesi si Yoruba"
      },
      {
        "id": "2",
        "value": "– Awon akekoo se ere ori itage kukuru lori asa igbeyawo – Awon akekoo salaye awon ilana ati igbese inu asa igbeyawo – Awon akekoo se akosile koko-ise sinu iwe won lati oju patako ikowe"
      },
      {
        "id": "3",
        "value": "Awon akekoo so itan isedale awon Yoruba gege bi won ti gbo o lenu agbalagba – Awon akekoo sapejuwe awon eya Yoruba – Awon akekoo se akosile ohun ti koko ise da le lorissinu iwe won"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Kadiboodu ti a ko awon owe ati akanlo ede to suto ninu iwe litirese yii Awon akekoo meji ti won se afihan aayan ogbufo akekoo kan n so ede geesi ti akekoo keji si n tumo ede Geesi naa si edde Yoruba https://wwww.worldcat.org/ https://schemeofwork.com/yoruba-language-scheme-of-work-sss-1-lagos-state/https://youtube:KAPTV https://m.facebook.com/"
      },
      {
        "id": "2",
        "value": "&nbsp; Aworan ayeye igbeyawo abinibi i. Awon ohun elo idana igbeyawo https://youtube.mosebolatan/ https://m.facebook.com/ https://alawiyeblog.wordpress.com/"
      },
      {
        "id": "3",
        "value": "Akekoo to n kawe si awon elegbe re leti Kaadi pelebepelebe ti ati ko awon oro tuntun to suyo si pelu itumo won &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "7",
    "Weeks": "7",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Idanwo ranpe / Ibewo /isinmi idajii saa"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "Mid Term Break"
  },
  {
    "_id": "8",
    "Weeks": "8",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aayan Ogbufo"
      },
      {
        "id": "2",
        "value": "Asa: Asa igbeyawo ni ile Yoruba Awon orisiirisii igbeyawo ti o wa i. Igbeyawo nisuloka ii. Jiji iyawo gbe lo fun oko iii. Pade mi ni idiko(iyawo salo ile oko) io. Gbigbe ese le iyawo (awon oba, ijoye ati alagbara) (B) Ana sise ni ile Yoruba."
      },
      {
        "id": "3",
        "value": "Litirese: itan oloro geere gege bi orisun itab ati Asa Yoruba. Asa bi Yoruba se n sin okun sinu ile"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Sise ogbufo ayoka ede Geesi si ede Yoruba"
      },
      {
        "id": "2",
        "value": "Ni opin idanuilekoo, awon akekoo yoo le: Salaye awon orisirtisi igbeyawo ti o wa ni ile Yoruba ii. Salaye ana sise ni ilo Yoryuba (kiko eru lo ile iyawo)"
      },
      {
        "id": "3",
        "value": "NI opin idanilekoo, awon akekoo yoo le: i. Salaye awon itan oloro geere ti o so nipa itan orisun ati asa Yoruba ii. Salaye asa bi Yoruba se n sin oku sinu ile."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo se aayan ogbfo ayoka ewi ede Geesi si Yoruba. – Awon akekoo se jumo aayan ogbufo elewi ni kilaasi"
      },
      {
        "id": "2",
        "value": "`- Awon akekoo se alaye lori orisiirisii asa igbeyawo ti o wa ati iyato laarin won -Awon akekoo salaye bi a se n dana ninu asa igbeyawo ile wa. – Awon akekoo ko koko ise sinu iwe won"
      },
      {
        "id": "3",
        "value": "– Awon akekoo salye awon itan ti o jemo orisun asa ati ise ile Yoruba – Awon akekoo jiroro nipa asa isinku nile Yoruba – Awon akekoo se akosile koko ise sinu iwe won"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp; Eko Ajemawujo &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Yoka ede geesi kan lati tumo re si ede Yoruba. https://www.worlcat.org/ https://m.facebook.com/"
      },
      {
        "id": "2",
        "value": "Aworan enu ile ana Aworan ayeye igbeyawo nisuloka"
      },
      {
        "id": "3",
        "value": "Ate Aworan Nipa Asa Isinku https://egbeoninmoedeyoruba.filewordpress.com/"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "9",
    "Weeks": "9",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Onka Yoruba onkaye lati ori ookan titi de egberun"
      },
      {
        "id": "2",
        "value": "Asa: Igbeyawo ode-oni"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe ere onitan apileko “Nitori Owo” (Akinwunmi Isola)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanuilekoo, awon akekoo yoo le: i. Salaye ilana meta ti a n gba se onka-ede Yoruba(ilana ilopo, ilana aropo ati ilana ayokuro) ii. Lo awon ilana onka lati se onkaye lati ori ookan de egberun"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye awon orisii igbeyawo ode-oni ii. So awon iyato ati ijora ti o wa ninu igbeyawo ode-oni ati atijo"
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Ka iwe litirese yii funra won ni iyara ikawe ii. Salaye awon koko ti ibi ti won ka da lori iii. Salaye awon asa ati ise Yoruba ti os suyo nibi ti won ka"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "-Awon akekoo se alaye awon ona ti a n gba se onka ede Yoruba – Awon akekoo lo awon ilana onka lede Yoruba. – Awon akekoo se akosile koko ise latioju patako ikowe"
      },
      {
        "id": "2",
        "value": "– Awon akekoo salaye awon orisii igbeyawo aye atijo ati ode oni -Salaye awon ijora ati ijora ti o wa laarin igbeyawo aye atijo ati ode-oni -Se akosile koko ise sinu iwe won. &nbsp;"
      },
      {
        "id": "3",
        "value": "-Awon akekoo ka iwe litirese ere onise apileko ‘Nitori Owo’ ni kilaasi -Salaye awon koko ti o suyo nibi ti won wa -Tokasi asa ati ise Yoruba ti o suyo ninu ibi ti won ka -Se akosile ohun ti koko ise dale lori &nbsp;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ero Ayelujara Ogbon Idari Akekoo Eko Ajemawujo &nbsp; &nbsp; &nbsp; &nbsp;"
      },
      {
        "id": "2",
        "value": "Ijiroro nipa asa igbeyawo aye atijo ati ode-oni Ifowosewopo ati ibara-eni-soro"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Ogbon Idari Akekoo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "i. Koro palabe/ igi isana ii. Saati ti ati ko onka ni ede oyinbo si ati bi a se n pee ni ede Yoruba iii. Saati ti a ko awon onka edee Yoruba si. Onka ati isro Yoruba- Lawanson mailto:Olumuyiwa@okadabooks.com"
      },
      {
        "id": "2",
        "value": "Awon aworan to se afihan awon igbeyawo ode oni. https://www.bbc.com/  Youtube.app.MOSEBOLANTATO"
      },
      {
        "id": "3",
        "value": "Iwe Litirese apileko ere onitan ‘Nitori Owo’"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "10",
    "Weeks": "10",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede: Aroko Asotan tabi oniroyin"
      },
      {
        "id": "2",
        "value": "Asa: Oyun nini, itoju oyun ati ibimo"
      },
      {
        "id": "3",
        "value": "Litirese: Itupale asayan iwe ere onitan apileko “Nitori owo’ (Akinwunmi Isola) ti ajo WAEE/NEEO)"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye kikun lori iru aroko asotan je ii. So awon ori-oro ti o jemo aroko asotan/oniroyin iii. Salaye ilana ati ogbon fun kiko aroko asotan/oniroyin (ilapa ero) io. Ko aroko lori ori oro ti o jemo aroko asotan"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye igbagbo Yoruba nipa agan, omo bibi ati abiku ii. Salaye orisiirisii aajo lati je ki obinrin tete ni oyun iii. Salaye orisiirisii itoju ti awon Yoruba maa n se fun alaboyun titi yoo fi bi omo io. Se awon orisiirisii eewo ati oro idile (B.a ate jije- obe lai si iyo) &nbsp;"
      },
      {
        "id": "3",
        "value": "Ni opin idanuilekoo, awon akekoo yoo le: i. Salaye nipa Ifiwawoda awon eda itan ii. Fa awon ona – ede inu iwe itirese yii jade"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Awon akekoo salaye ohun ti aroko oniroyin ati asotan je -Awon akekoo se afihan apeere awon ori-oro ti o jemo aroko oniroyin/asotan -Salaye awon ilana ati ogbon nipa aroko oni iroyin/asotan -Ko apeere aroko oniroyin/Asotan"
      },
      {
        "id": "2",
        "value": "-Awon akekoo jiroro nipa igbagbo ati ero Yoruba nipa Itoju iyun ati omo bibi -salaye nipa ohun ti won ko nipa agan, omo bibi ati abiku -so orisirisi aajo ti o n waye ki obinrin le tete loyun -daruko orisi ona ti Yoruba n gba se itoju oloyun -salaye oniruuru eewo ati oro idile ti won n se fun eni to sese bimo -Sise akosile ohun ti koko ise da le lori &nbsp;"
      },
      {
        "id": "3",
        "value": "-Awon akekoo se apejuwe bi onkowe Litirese&nbsp; ‘Nitori Owo’ se Iwa awon eda-itan inu iwe naa han -Awon akekoo fa ona-ede inu iwe “Nitori Owo” yo pelu Itumiowo se yo pelu Itumiowo yo yo pelu Itumiowo se akosile koko ise sinu iwe won."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro &nbsp;"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Iwe iroyin atigbadegba akede Odua tabi Alaroye Aroko Lede Yoruba- Lawanson mailto:Olumuyiwa@okadabooks.com https://ebenexeralonge97.blogspot.com/ "
      },
      {
        "id": "2",
        "value": "Aworan onisegun ibile ati alaboyun ti o n toju &nbsp; https://m.facebook.com/ https://olukoniblogspot.com/"
      },
      {
        "id": "3",
        "value": "Iwe Litirese apileko ere onitan ‘Nitori Owo’ Kaadiboodu ti a ko awon ona ede ti o suyo ninu iwe yii si."
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "11",
    "Weeks": "11",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Ede Atunyewo Eko lori Eka Ede Yoruba"
      },
      {
        "id": "2",
        "value": "Asa: Asa isomoloruko ni ile Yoruba"
      },
      {
        "id": "3",
        "value": "Litirese: litirese Alohun oloro wuuru. Alo orisirisii"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "Ni opin idanilekoo awon akekoo yoole: i.&nbsp; Sapejuwuwe awon eka ede Yoruba ti o wa B. A ijesa, Ekiti, Oyo, Ijebu, Igbomina abbi. ii. Salaya iwulo Yoruba Ajumoki iii. Fie ka ede we Yoruba Ajumolo &nbsp;"
      },
      {
        "id": "2",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye Pataki siso omo loruko ii. Salaye eto isomoloruko ni ile Yoruba iii. Salaye bi a se n fi ohun elo isomoloruko sadura fun omo titun"
      },
      {
        "id": "3",
        "value": "Ni opin idanilekoo, awon akekoo yoo le: i. Salaye Orisiirisi Alo Ti o wa ii. Salaye iwulo Alo pipa iii. Salayee Awon ona Ede, Asa ati Litirese Yoruba"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "– Awon akekoo jiroro nipa awon eka ede Yoruba ti o wan i agbegbe won. – Awon akkoo saaye afiwe ati iyato to walaarin eka-ede Yoruba Ajumolo ati eka-ede – Awon akekoo salaye anfaani ati iwulo Yoruba ajumolo – Awon akekoo se akosile koko ise sinuiwe won &nbsp;"
      },
      {
        "id": "2",
        "value": "– Awon akekoo ere ori-itage lori bi a se n lo awon ohun elo isomoloruko – Awon akekoo salaye ohun elo isomoloruko laye atijo – Awon akekoo se akosile koko ise sinu iwe won"
      },
      {
        "id": "3",
        "value": "– Awon akekoo dahun orisii ibeere lori ise saa keji. – Awon akekoobeere orisiirisi ibeere lori ise saa keji"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Ogbon wiwa ojutuu si isero ati arojinle Ifowosowopo ati ibaraenisoro Ijiroro nipa eto ati liana omo bibi nilo Yoruba"
      },
      {
        "id": "2",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Ogbon Idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "3",
        "value": "Ogbon Atinuda ati Oye Ogbon Arojinle ati yiyanju isero Ogbon Ajumose ati Ibanisoro Ogbon Idari Akekoo Eko Ajemawujo"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Maapu ti o se afuhan ile awon eya Yoruba. https://yomikipedia.org/ https://www.scrip.org/"
      },
      {
        "id": "2",
        "value": "Awon ohun elo isemoloruko bi oyin, adun, iyo, otiu, ireke, epo pupa omi abbl https://isolataiwojoseph.blogspot.com/ https://rodacollege.com/"
      },
      {
        "id": "3",
        "value": "Agbeyewo ise saa keji lori Ede, Asa ati Litirese Yoruba"
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "12",
    "Weeks": "12",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": "Idanwo saa keji"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "REVISION"
  },
  {
    "_id": "13",
    "Weeks": "13",
    "Subject": "Yoruba",
    "Class": "SS1",
    "Term": "Second Term",
    "Topics": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "EXAMINATION"
  }
]
